{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"input_4": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"conv2d_transpose_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "8192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8192"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_3/Relu", "op": "_FusedMatMul", "input": ["input_4", "StatefulPartitionedCall/sequential_3/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/dense_3/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/reshape_1/Shape", "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack", "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_3/reshape_1/strided_slice", "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/2", "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_3/dense_3/Relu", "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/reshape_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_3/Shape", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/1", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/2", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_3/reshape_1/Reshape"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_3/conv2d_transpose", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_3/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_4/Shape", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/Relu"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_4/conv2d_transpose", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_5/Shape", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/1", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/2", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/Relu"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_5/conv2d_transpose", "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/conv2d_transpose_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_3/MatMul/ReadVariableOp", "shape": [2, 8192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_3/BiasAdd/ReadVariableOp", "shape": [8192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/reshape_1/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_3/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_4/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_transpose_5/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}